# Pandas (el R de Python)

### Importar biblioteca

In [2]:
import pandas as pd

### Series de pandas

In [7]:
# Definición de una Serie
serie1 = pd.Series([17,5,7,5,67,84,29,52,12,53,1,10])
serie1.head(15)

0     17
1      5
2      7
3      5
4     67
5     84
6     29
7     52
8     12
9     53
10     1
11    10
dtype: int64

In [6]:
# Indices
serie2 = pd.Series([5.7,8.5,9.1,5.5,8.2,9.0,10,7.0,7.7,9.9],
                   index=["A","B","C","D","E","F","G","H","I","J"])
print(serie2)

A     5.7
B     8.5
C     9.1
D     5.5
E     8.2
F     9.0
G    10.0
H     7.0
I     7.7
J     9.9
dtype: float64

In [8]:
# Acceso a los elementos / Filtrado
print(serie2[2])
print(serie2[1:4])

9.1
B    8.5
C    9.1
D    5.5
dtype: float64

In [16]:
# Operaciones entre series
s1 = pd.Series([1, 3, 5])
s2 = pd.Series([2, 4, 6])
print(s1 + s2)
print(s1 - s2)
print(s1 * s2)
print(s1>3)
print(s1[s1>=3])
print(s1.mean())

0     3
1     7
2    11
dtype: int64
0   -1
1   -1
2   -1
dtype: int64
0     2
1    12
2    30
dtype: int64
0    False
1    False
2     True
dtype: bool
1    3
2    5
dtype: int64
3.0

### Dataframes de pandas

In [17]:
# Dataframe vacío
df1 = pd.DataFrame()
df1.head()

Empty DataFrame
Columns: []
Index: []

In [4]:
# Data frame desde una lista de listas
l1 = ['Sofía', 33, 'ARG', 1.77]
l2 = ['Pedro', 55, 'USA', 1.75]
l3 = ['Juan' , 18, 'CHL', 1.68]
l4 = ['María', 47, 'ECU', 1.50]
l5 = ['Lucas', 80, 'ESP',  1.8]
ListaDeListas = [l1, l2, l3, l4, l5]

df2 = pd.DataFrame(ListaDeListas, columns=['Nombre', 'Edad', 'Origen', 'Altura'])
df2.head()

  Nombre  Edad Origen  Altura
0  Sofía    33    ARG    1.77
1  Pedro    55    USA    1.75
2   Juan    18    CHL    1.68
3  María    47    ECU    1.50
4  Lucas    80    ESP    1.80

In [33]:
# Acceso a los elementos / Filtrado
print(df2.loc[0,'Nombre'])
print(df2.iloc[0,0])
df2[['Nombre', 'Origen']].head()

Sofía
Sofía

  Nombre Origen
0  Sofía    ARG
1  Pedro    USA
2   Juan    CHL
3  María    ECU
4  Lucas    ESP

In [30]:
# Operaciones entre columnas
df2['2 edades'] = df2['Edad'] * 2
df2.head()

  Nombre  Edad Origen  Altura  2 edades
0  Sofía    33    ARG    1.77        66
1  Pedro    55    USA    1.75       110
2   Juan    18    CHL    1.68        36
3  María    47    ECU    1.50        94
4  Lucas    80    ESP    1.80       160

In [34]:
df2['NombreYPais'] = df2['Nombre'] + ' de ' + df2['Origen']
df2.head()

  Nombre  Edad Origen  Altura  2 edades   NombreYPais
0  Sofía    33    ARG    1.77        66  Sofía de ARG
1  Pedro    55    USA    1.75       110  Pedro de USA
2   Juan    18    CHL    1.68        36   Juan de CHL
3  María    47    ECU    1.50        94  María de ECU
4  Lucas    80    ESP    1.80       160  Lucas de ESP

In [12]:
s = pd.Series([1, 2, 3, 4])
s[s>2]

2    3
3    4
dtype: int64